# 2. Adding an image
Back in your notebook, follow these steps to add an image of a hare using a URL:

Go to this link.

Get the URL of the hare image. To do this:

hover over the image –> right click –> “Copy Image Address”.
At the end of the markdown cell with the dataset description, **use markdown sytanx** to add the image from its URL:

![image description](https://upload.wikimedia.org/wikipedia/commons/thumb/8/8a/SNOWSHOE_HARE_%28Lepus_americanus%29_%285-28-2015%29_quoddy_head%2C_washington_co%2C_maine_-01_%2818988734889%29.jpg/1452px-SNOWSHOE_HARE_%28Lepus_americanus%29_%285-28-2015%29_quoddy_head%2C_washington_co%2C_maine_-01_%2818988734889%29.jpg?20170313021652)

#No licensing required
ALAN SCHMIERER, Set 72157600401137773, ID 18988734889, Original title SNOWSHOE HARE (Lepus americanus) (5-28-2015) quoddy head, washington co, maine -01

# 3. Data loading and preliminary exploration

Back in your notebook, import the 55_Hare_Data_2012.txt file from its URL using the pandas.read_csv() function. Store it in a variable named hares.
- Using pandas methods, obtain preliminary information and explore this data frame. Consider answering some of these questions:
- What are the dimensions of the dataframe and what are the data types of the columns? Do the data types match what you would expect from each column?
- Are there any columns that have a significant number of NA values?
- What are the minimum and maximum values for the weight and hind feet measurements?
- What are the unique values for some of the categorical columns?
- An explroatory question about the data frame you come up with!

In [7]:
import pandas as pd

In [12]:
hares = pd.read_csv('https://pasta.lternet.edu/package/data/eml/knb-lter-bnz/55/22/f01f5d71be949b8c700b6ecd1c42c701')

In [14]:
# Find dimensions of dataframe
hares.shape

(3380, 14)

In [16]:
hares.shape[0] # rows
hares.shape[1] # columns

14

In [25]:
# Data types for each column
hares.dtypes

date           object
time           object
grid           object
trap           object
l_ear          object
r_ear          object
sex            object
age            object
weight        float64
hindft        float64
notes          object
b_key         float64
session_id      int64
study          object
dtype: object

In [24]:
# Exploring NA values
hares.isna().sum()
# time, age, hindft, notes

date             0
time          3116
grid             0
trap            12
l_ear           48
r_ear          169
sex            352
age           2111
weight         535
hindft        1747
notes         3137
b_key           47
session_id       0
study          163
dtype: int64

In [30]:
# min and max weight and feet measurements
hares[['weight','hindft']].describe()

            weight       hindft
count  2845.000000  1633.000000
mean   1346.081547   130.872627
std     345.160112    16.155295
min       0.000000    60.000000
25%    1180.000000   128.000000
50%    1400.000000   135.000000
75%    1580.000000   140.000000
max    2365.000000   160.000000

In [37]:
# What are the unique values for some of the categorical columns?
hares['sex'].unique()
hares['study'].unique()

array(['Population', 'Collar', nan, 'Metabolic', 'Metabolic/Collar'],
      dtype=object)

In [44]:
hares_pop = hares[hares['study'] == "Population"]
hares_pop.head()

,date,time,grid,trap,l_ear,r_ear,sex,age,weight,hindft,notes,b_key,session_id,study
0,11/26/1998,NaN,bonrip,1A,414D096A08,NaN,NaN,NaN,1370.0,160.0,NaN,917.0,51,Population
1,11/26/1998,NaN,bonrip,2C,414D320671,NaN,M,NaN,1430.0,NaN,NaN,936.0,51,Population
2,11/26/1998,NaN,bonrip,2D,414D103E3A,NaN,M,NaN,1430.0,NaN,NaN,921.0,51,Population
3,11/26/1998,NaN,bonrip,2E,414D262D43,NaN,NaN,NaN,1490.0,135.0,NaN,931.0,51,Population
4,11/26/1998,NaN,bonrip,3B,414D2B4B58,NaN,NaN,NaN,1710.0,150.0,NaN,933.0,51,Population

In [56]:
# Our Question: Groupby trap and get the average weight and sort values 
hares_pop = hares[hares['study'] == 'Population']
hares_pop_mean_wt = hares.groupby('trap').mean('weight').sort_values('weight', ascending = False)
hares_pop_mean_wt

           weight      hindft       b_key  session_id
trap
7f    1640.000000         NaN  734.250000   35.750000
5c    1540.000000         NaN   63.000000   64.000000
7D    1535.000000  125.500000  388.777778   64.833333
4f    1534.166667  142.000000  487.125000   38.375000
9C    1525.000000  131.777778  433.400000   69.866667
...           ...         ...         ...         ...
4e     565.000000   90.000000   72.000000   50.000000
6b     450.000000   96.000000   76.000000   50.000000
4c     427.500000   87.500000   68.500000   50.000000
3g            NaN         NaN  975.000000   37.000000
4b            NaN         NaN   63.000000   64.000000

[121 rows x 4 columns]